[
  {
    "task": "Which of the following statements about project management are true?",
    "answerList": [
      "Project management has an impact on the profitability of success.",
      "Project management orchestrates other project disciplines to achieve the project goals.",
      "Thanks to it we can compare with other project’s key factors."
    ]
  },
  {
    "task": "Based on the Software Project Outcome Rates: 2018 Report, what percentage of projects were completed on time and within budget (for the year of 2017)?",
    "answerList": ["29 %"]
  },
  {
    "task": "Každý podnik musí pokrýt 12 procesů - _ klíčových a _ podpůrných.",
    "answerList": ["cíle", "finální výstupy"]
  },
  {
    "task": "In organization, we have 12 processes. We divide these processes into Core processes and Support processes. Project management is one of the Core processes.",
    "answer": false
  },
  {
    "task": "Which of the definitions of project management are true?",
    "answerList": [
      "A certain uniqueness is typical for a project.",
      "A project can have a tangible form, however, Unicorn company focuses primarily on the intangible form of projects."
    ]
  },
  {
    "task": "Projekt je úspěšný pokud:",
    "answerList": [
      "přimět lidi dělat to, co chceme",
      "přimět lidi přidávat hodnotu",
      "mít správné lidi na správných místech",
      "dodávat produkty a služby zákazníkům"
    ]
  },
  {
    "task": "Technologie jsou pro úspěch projektu _ důležité než-li procesy procesy a lidi.",
    "answerList": ["méně"]
  },
  {
    "task": "Které z následujících parametrů musíme dodržovat při řízení projektu?",
    "answerList": ["kvalita", "rozsah", "riziko"]
  },
  {
    "task": "Which of the definitions about the role of a project manager are true?",
    "answerList": [
      "A project manager must mainly ensure that at any point during the project, everyone knows what they should do and by when.",
      "A project manager ensures that everyone in the team has what they need to work.",
      "A project manager ensures that team members work on the most suitable tasks.",
      "A project manager focuses on delivery in time and on quality."
    ]
  },
  {
    "task": "What are the project phases?",
    "answerList": [
      "Initiation",
      "Planning",
      "Execution",
      "Monitoring and Controlling",
      "Closing"
    ]
  },
  {
    "task": "Jaké jsou nejběžnější metodiky projektového řízení?",
    "answerList": ["PRINCE2 (+ PRINCE2 Agile)", "IPMA", "PMI PMBOK"]
  },
  {
    "task": "Která tvrzení o metodice Prince2 jsou pravdivá?",
    "answerList": [
      "<UU5.Bricks.Strong> Prince2 Agile </UU5.Bricks.Strong> patří mezi agilní techniky a upravuje dílčí aspekty metodiky tak,  aby byly kompatibilní s agilními metodami, jako je SCRUM.",
      "Je to <UU5.Bricks.Strong> nejvíce populární metodika </UU5.Bricks.Strong> a certifikace PM v <UU5.Bricks.Strong> České republice </UU5.Bricks.Strong>.",
      "Je <UU5.Bricks.Strong> velmi normativní </UU5.Bricks.Strong> - lze se ji snadno naučit a použít."
    ]
  },
  {
    "task": "_ software development/project methodologies are based on an 'engineering approach' –⁠ planning all aspects well, manufacturing with precision, ensuring quality control and delivery.",
    "answerList": ["Tradiční"]
  },
  {
    "task": "<UU5.Bricks.Strong> Agilní </UU5.Bricks.Strong> metodiky vycházejí z předpokladu, že nejlepším možným způsobem, jak dosáhnout úspěšné implementace,  je co nejrychlejší vývoj softwaru, jeho dodání zákazníkovi (i s omezenou funkčností) a následně upravovat software na základě připomínek.",
    "answer": true
  },
  {
    "task": "What goals are we trying to achieve with the concept of Production Lines?",
    "answerList": [
      "predictable and guaranteed delivery",
      "continuous improvement",
      "fast requirements delivery",
      "ability to change the scope",
      "reduce risks"
    ]
  },
  {
    "task": "What is the main Unicorn Production Line?",
    "answerList": ["uuApp Production Line"]
  },
  {
    "task": "Besides Processes, Tools, Knowledge Base, and Marketing Mix, uuApp Production Line also includes _.",
    "answerList": ["Component Libraries, Evangelists"]
  },
  {
    "task": "Unicorn Universe Process is inspired by which methodologies?",
    "answerList": ["IDEF", "RUP", "PRINCE2", "ITIL", "SCRUM"]
  },
  {
    "task": "There is one “right” (ultimate) project management methodology. This is the reason why Unicorn utilize the fundamentals of RUP exclusively.",
    "answer": false
  },
  {
    "task": "The dual track in Agile consists of Definition Track and Delivery Track, and utilizes Product and Delivery Backlog.",
    "answer": true
  },
  {
    "task": "Which of the uuApp Processes from Product cycle and Delivery cycle overlap?",
    "answerList": ["Business Design, UAT & Deployment"]
  },
  {
    "task": "Connect the uuApp Processes with their products.",
    "answerList": [
      ["Requirements Analysis", "Business Requests"],
      ["Business Design", "Business Model"],
      ["Design", "Application Model"],
      ["Implementation & Testing", "uuApp (code, test cases, etc.)"],
      ["Deployment & Support", "uuApp"]
    ]
  },
  {
    "task": "Because there are many of the uuApp Processes, it’s better to utilize different support applications from the market that can be sometimes connected, and that have their own vision.",
    "answer": false
  },
  {
    "task": "Which roles can be typically found in Integration Team?",
    "answerList": [
      "uuApp Project Manager",
      "uuApp Business Architect",
      "uuApp Software Architect",
      "uuApp Test Architect"
    ]
  },
  {
    "task": "The Integration Team and Delivery Team can be organizationally separated, but they should cooperate closely.",
    "answer": true
  },
  {
    "task": "Select the correct statement about the cooperation approach between Unicorn units.",
    "answerList": [
      "The cooperation approach between the Executive Units or Product Hub and Software Factory can differ."
    ]
  },
  {
    "task": "What are some of the main benefits of the uuApp Production Line?",
    "answerList": [
      "Early mitigation of risks and problems.",
      "Predictable and guaranteed delivery.",
      "Reduction of the amount of bugs and reimplementation.",
      "No vendor or personal lock.",
      "Measurement and continuous improvement."
    ]
  },
  {
    "task": "What are some of the limitations of uuApp Production Line?",
    "answerList": [
      "More formal approach than the market standard.",
      "Reduction of a creative space.",
      "Software development is more expensive in the analysis and design phase.",
      "Reduction of space for technical individuals."
    ]
  },
  {
    "task": "uuApp Production Line is based on _. Therefore, the development cycle _ a fixed time frame.",
    "answerList": ["regular cycles", "must have"]
  },
  {
    "task": "Přiřaďte klíčový artefakt k aktivitě, pro kterou se používá.",
    "answerList": [
      [
        "A4",
        "Artefakt, jehož účelem je jednoduše formulovat cíle a záměr naší práce, včetně toho, jak dosáhnout cíle za stanovených KKTR podmínek.  Všechny klíčové nápady by měly být napsány tak, aby se vešly na list papíru A4."
      ],
      [
        "Klíčový úkol",
        "Slouží ke správě složitých úkolů v rámci organizační jednotky, jejichž řešení trvá několik měsíců a které řeší jedna osoba nebo malá skupina lidí."
      ],
      [
        "Organizační struktura",
        "Organizace interního a externího projektového týmu a komunikační matice."
      ],
      [
        "Plán zdrojů",
        "Při jejich plánování zaznamenáváme, které zdroje budeme kdy potřebovat."
      ],
      [
        "Interní pravidla",
        "Artefakt, kterým jsme stanovili závazná pravidla v rámci organizační jednotky, která rozšiřuje obecně platné podmínky zaměstnávání ve společnosti."
      ]
    ]
  },
  {
    "task": "Co platí pro zahájení projektu?",
    "answerList": [
      "Plán by měl být založen na výstupech.",
      "Obsah A4 projektu by měl být potvrzen zadavatelem nebo přímo zákazníkem."
    ]
  },
  {
    "task": "Co je účelem zahajovací schůzky (Kick-off)?",
    "answerList": [
      "představit tým",
      "porozumět pozadí projektu",
      "dohodnout se na efektivní spolupráci",
      "pochopit, co je třeba udělat"
    ]
  },
  {
    "task": "Úvodní schůzku (tzv. Kick-off) připravujeme v úzké spolupráci s managementem klienta během prvních 10 dnů projektu.",
    "answer": true
  },
  {
    "task": "Které z následujících aktivit by měly být součástí zahájení projektu?",
    "answerList": [
      "Objasnit, co a jak by měl projekt skutečně dělat.",
      "Vypracovat klíčové úkoly na základě specifikace cílů.",
      "Vytvořit vhodné implementační prostředí."
    ]
  },
  {
    "task": "What are the most important inputs when handover a project from sales to realization?",
    "answerList": ["Contract", "Proposal", "Benefits", "QSTB"]
  },
  {
    "task": "Jaké role můžete potkat ve standardním IT projektovém týmu?",
    "answerList": [
      "Projektový Manažer",
      "Business Architect",
      "Konfigurační Manažer"
    ]
  },
  {
    "task": "Přiřaďte každé roli její odpovědnosti.",
    "answerList": [
      [
        "Projektový Manažer",
        "V první řadě zodpovídá za plánování, pokrok a úspěch dokončení projektů v oblasti ICT, jakož i za dosažení očekávané přidané hodnoty."
      ],
      [
        "Business Architect",
        "Je odpovědný za správu požadavků zákazníka. Toto je klíčová role pro všechny projekty, které vyžadují hluboké pochopení obchodních procesů zákazníka, jejich analýzu, dokumentace a zejména vývoj řešení."
      ],
      [
        "Software Architect",
        "Technicky vede tým, který se podílí na přípravě projektu řešení, a také tým, který řešení implementuje. Dokáže navrhnout a implementovat řešení, která splňují všechny funkční i nefunkční požadavky v rámci KKTR."
      ],
      [
        "Test Architect",
        "Odpovídá za celkovou kvalitu výstupů i za jejich soulad s cílovou kvantitou, termínem a rozpočtem. Hledá odpověď na otázku 'Jak a co testovat', zodpovídá za řízení rizik a priorit."
      ],
      [
        "Konfigurační Manažer",
        "Přebírá odpovědnost za instalaci a správu IT prostředí projektu, vývoj buildů a instalací apod. Tato role nese přímou odpovědnost za funkčnost instalace pro zákazníka."
      ]
    ]
  },
  {
    "task": "<UU5.Bricks.P>  <UU5.Bricks.Em>Je schopen samostatně programovat pomocí příslušného programovacího jazyka a souvisejících technologií. V rámci své práce se podílí na realizaci technického projektu. Má dobré komunikační dovednosti pro komunikaci s technickým specialistou zákazníka. </UU5.Bricks.Em> </UU5.Bricks.P> <UU5.Bricks.P>  Která role odpovídá tomuto popisu? </UU5.Bricks.P>",
    "answerList": ["seniorní vývojář"]
  },
  {
    "task": "Assign the team worker classification with the type of motivation.",
    "answerList": [
      ["Workers focused on task (workaholics).", "Motivated by the work."],
      [
        "Workers focused on cooperation (friends).",
        "Motivated by the existence of the team and presence of coworkers."
      ],
      [
        "Workers focused on themselves (egoists).",
        "Motivated by their success."
      ]
    ]
  },
  {
    "task": "Team is a group of people / organism that was created to achive some goals by execution of the coordinated actions.",
    "answer": true
  },
  {
    "task": "What aspects should project manager access when creating a new team?",
    "answerList": [
      "Project constraints",
      "Team maturity",
      "Long-term vision for the team/team members",
      "Way of delivery (Waterfall/Scrum, etc)"
    ]
  },
  {
    "task": "In Fix Time – Fix Price project is the main focus on _ while Time & Material project is focused on _.",
    "answerList": ["budget, deadlines, outputs", "processes and outputs"]
  },
  {
    "task": "Seřaďte činnosti v rámci procesu řízení komunikace tak, jak na sebe navazují.",
    "answerList": [
      "Definice konkrétní informační potřeby",
      "Zahájení komunikace",
      "Řízení komunikace",
      "Ukončení komunikace"
    ]
  },
  {
    "task": "Přiřaďte aktivity k dané fázi procesu řízení komunikace.",
    "answerList": [
      [
        "Definice konkrétní informační potřeby",
        "nastavena organizační a komunikační struktura"
      ],
      [
        "Zahájení komunikace",
        "zavedení komunikačního plánu všem zúčastněným stranám"
      ],
      [
        "Řízení komunikace",
        "řízení sdílení informací a komunikace ve všech fázích projektu"
      ],
      [
        "Ukončení komunikace",
        "oficiální uzavření všech pravidelných a nepravidelných informačních povinností"
      ]
    ]
  },
  {
    "task": "Který komunikační kanál je nejlepší použít v případě, že máme pouze kusé informace o neočekávaných událostech na projektu, nebo informace s vysokou prioritou a časovou naléhavostí?",
    "answerList": ["zpráva (hovor, e-mail, SMS apod.)"]
  },
  {
    "task": "Která tvrzení ohledně schůzky jako aktivního komunikačního nástroje v rámci projektů jsou pravdivá?",
    "answerList": [
      "Úroveň informací musí být nastavena podle účastníků schůzky/cílové skupiny.",
      "Musí mít jasnou agendu a cíle."
    ]
  },
  {
    "task": "Přiřaďte nástroj ke způsobu komunikace a jeho využití na projektu.",
    "answerList": [
      [
        "Aktivní",
        "Report",
        "Může být použit jako podkladový materiál pro schůzku o stavu projektu. Jeho obsah by měl být vždy schválen zúčastněnými stranami."
      ],
      [
        "Pasivní",
        "Portál pro sdílení informací",
        "Samoobslužné weby pro pasivní sdílení informací a výstupů, pokud je to možné. Může mít několik úrovní."
      ]
    ]
  },
  {
    "task": "Jaké informace by měl obsahovat seznam kontaktů v rámci komunikačního schématu projektu?",
    "answerList": [
      "jméno a příjmení",
      "role",
      "telefonní číslo, e-mail",
      "vztahy"
    ]
  },
  {
    "task": "Co vše by měla obsahovat organizační struktura projektu?",
    "answerList": [
      "Hierarchii všech stran účastnících se projektu, struktury týmů, vztahy v rámci projektových týmů a role projektu."
    ]
  },
  {
    "task": "U velkých projektů je dobrým zvykem připravit distribuční seznam (např. seznam e-mailů) pro různé druhy zpráv.",
    "answer": true
  },
  {
    "task": "Co je potřeba udělat, když během telefonního hovoru dojde k důležitému projektovému rozhodnutí?",
    "answerList": [
      "Vše by mělo být zaznamenáno v zápisu a zúčastněné strany by měly být informovány. Pokud je to možné, jsou zaznamenány a zpracovány také následné činnosti."
    ]
  },
  {
    "task": "Který komunikační kanál je nejvhodnější použít, pokud se na projektu vyskytne vážný problém?",
    "answerList": [
      "Telefonní hovor, protože je to nejrychlejší způsob, jak informovat a být informován. Následovat bude písemné shrnutí a další činnosti."
    ]
  },
  {
    "task": "Which of the following statements about full home-office working mode are true?",
    "answerList": [
      "It's necessary to set up and keep regular meetings which are necessary to replace on-site communication.",
      "In messaging, we shouldn't send a group message which is relevant only to a single person.",
      "The risk that we don't find team members that are not satisfied with their work is higher when we work remotely."
    ]
  },
  {
    "task": "Které z následujících výroků týkajících se řízení očekávání nejsou pravdivá?",
    "answerList": []
  },
  {
    "task": "Proces řízení očekávání všech zúčastněných stran musí být nastaven primárně na začátku projektu. Jakmile projekt začne, tento proces již není důležitý.",
    "answer": false
  },
  {
    "task": "Seřaďte tři části řízení očekávání tak, jak na sebe navazují.",
    "answerList": ["Set", "Monitor", "Influence"]
  },
  {
    "task": "Budování důvěry, vzdělávání klienta, ospravedlnění a vysvětlení vašeho záměru (na základě zkušeností) jsou přístupy,  které musíte použít při _ očekávání.",
    "answerList": ["řízení"]
  },
  {
    "task": "Přiřaďte jednotlivé informační portály projektu k cílové skupině a jejich účelu.",
    "answerList": [
      [
        "Team Level Portal",
        "všichni členové týmu a podřízené projekty, pokud existují",
        "organizační a komunikační struktura, novinky o projektu, případně informace o prostředích projektu,  standardy a konvence, plán projektu, odkaz na klíčové vstupy a výstupy projektu, finanční výsledky"
      ],
      [
        "Internal Project Board Level Portal",
        "interní management a vedení projektu",
        "hlavní body projektu a rizika, aktuální prioritní úkoly, další důležité milníky projektu, odkaz na klíčové vstupy a výstupy projektu,  finanční výsledky, klíčové kontaktní informace, plán projektu, odkaz na obchodní dokumenty (smlouva, konečná nabídka atd.), nejnovější zprávy o stavu"
      ],
      [
        "Customer Level Portal",
        "zákazník nebo externí uživatel (partner, subdodavatel)",
        "důležité informace, zprávy o stavu, výstupy projektu - včetně předávacích a akceptačních protokolů, vstupy projektu - např. důležité e-maily,  poskytnuté manuály s logem, komunikační schéma, další výkonné dokumenty (A4, plán projektu, zápisy z jednání), logické brány pro systémy třetích stran pro sledování problémů/chyb"
      ]
    ]
  },
  {
    "task": "S jakými oblastmi v rámci procesu očekávání všech zúčastněných stran (SE) se můžete často setkat?",
    "answerList": [
      "kvalita doručení",
      "kvantita",
      "termíny dodání",
      "management processes",
      "budget"
    ]
  },
  {
    "task": "Jaký význam má Status Assessment (SA)?",
    "answerList": [
      "SA poskytuje pravidelné hodnocení stavu všech činností v jednotce, včetně hodnocení podřízených jednotek."
    ]
  },
  {
    "task": "Jak často je vhodné provádět Status Assessment?",
    "answerList": ["ideálně každý týden"]
  },
  {
    "task": "Status Assessment slouží k informování o úspěchu projektu, a proto by do něj neměly být zahrnuty špatné zprávy.",
    "answer": false
  },
  {
    "task": "Co znamená zkratka PBS?",
    "answerList": ["Product Breakdown Structure"]
  },
  {
    "task": "PBS obsahuje všechny výstupy/dodávky projektu a také vstupy, které jsou potřebné pro jejich vytvoření.",
    "answer": true
  },
  {
    "task": "V rámci projektu vytváříme pouze dva typy výstupů – výstupy _, které jsou konečnými produkty nebo se používají k jejich vytváření, a výstupy _, které pomáhají zmírnit riziko projektu (obvykle výstupy pro správu).",
    "answerList": ["věcné", "pokrývající rizika"]
  },
  {
    "task": "What does creating Status Assessment mean?",
    "answerList": [
      "To inform about current events and news in the unit.",
      "To assess the financial balance of the unit and alternatively balance of other resources in case they are important for the unit.",
      "To evaluate the state of important activities, the state of the subordinate organizational units (refer to their SA), etc. in terms of basic business processes and other evaluation metrics.",
      "To report on the progress of key tasks."
    ]
  },
  {
    "task": "Co je Product Breakdown Structure (PBS)?",
    "answerList": ["PBS je nástroj pro konkrétní definici rozsahu projektu."]
  },
  {
    "task": "II. Layer of Product Definition is considered to be:",
    "answerList": ["Product Breakdown Structure (PBS)"]
  },
  {
    "task": "Defining project products is an essential project management discipline. Defining project products is a critical success factor.",
    "answer": true
  },
  {
    "task": "Which project management methodology uses the PBS as its standard tool?",
    "answerList": ["PRINCE2"]
  },
  {
    "task": "The PBS contains all project _, as well as any _ necessary to produce them.",
    "answerList": ["products (deliverables)", "inputs"]
  },
  {
    "task": "A project PBS must contain at least the deliverables defined by the contract (based, among other things, on your offer).",
    "answer": true
  },
  {
    "task": "The PBS is prepared by the Project Manager and consulted with the following project management roles:",
    "answerList": ["Business Architect", "Software Architect", "Test Architect"]
  },
  {
    "task": "Each project must have its own _ to control all project activities. To build a plan, you have to know all _ you should produce and deliver (i.e. both material and risk-related ones).",
    "answerList": ["project plan", "products"]
  },
  {
    "task": "Which types of plans do we create for project management?",
    "answerList": ["Schedule", "Project plan", "Capacity plan"]
  },
  {
    "task": "Connect the plan types with their descriptions.",
    "answerList": [
      [
        "Schedule",
        "A time view of a project at the milestone level. Sometimes, it is also referred to as the global project plan. Typically, it captures a project stage and sometimes even subsequent stages (high-level views)."
      ],
      [
        "Project Plan",
        "A detailed breakdown of activities and deliveries in time at the PBS level (i.e. by deliverable), including their distribution across iterations/increments. It may also capture the states in which select deliverables will be at a given time (draft / final version, etc.)."
      ],
      [
        "Capacity Plan",
        "An outline that is based on the project schedule along with available capacities. It contains the overview of workers allocated to the project over time (week by week) and information on resource usage to date."
      ]
    ]
  },
  {
    "task": "Which project role is primarily responsible for the creation and management of plans?",
    "answerList": ["Project Manager"]
  },
  {
    "task": "A critical path is determined by identifying the longest stretch of dependent activities and measuring the time required to complete them from start to finish.",
    "answer": true
  },
  {
    "task": "Which statements about a project milestone are true?",
    "answerList": [
      "Milestone is a critical point in time and life of a project.",
      "We differentiate between project milestones and contractual milestones."
    ]
  },
  {
    "task": "What is the main input for the preparation of QQ?",
    "answerList": ["Product Breakdown Structure (PBS)"]
  },
  {
    "task": "Which project role is primarily responsible for the creation and management of QQTB (PBC)?",
    "answerList": ["Project Manager"]
  },
  {
    "task": "What is QQTB?",
    "answerList": ["Quantity, Quality, Time, Budget"]
  },
  {
    "task": "What do we consider as a project cost?",
    "answerList": [
      "Labour costs",
      "Travel costs",
      "Team building costs",
      "Hardware and licenses costs",
      "Target bonuses"
    ]
  },
  {
    "task": "Relation among Quantity, Quality, Time, and Budget is that they are independent of each other.",
    "answer": false
  },
  {
    "task": "Which areas of QQTB could be impacted by increasing scope (Quantity)?",
    "answerList": ["Time", "Budget"]
  },
  {
    "task": "For Steering Committee it is necessary to ensure the preparation of documents and presentations together with the client.",
    "answer": true
  },
  {
    "task": "Jaké činnosti by měl každý projektový manažer vykonávat denně?",
    "answerList": ["denní stand-up", "kontrola splněných úkolů"]
  },
  {
    "task": "Propojte Burndown Charts s jejich popisy.",
    "answerList": [
      [
        "Project Burndown Chart",
        "zobrazuje stav projektu z hlediska postupu prací a plnění plánu",
        "zobrazuje celý projekt"
      ],
      [
        "Sprint Burndown Chart",
        "zobrazuje průběh sprintu z hlediska zavírání úkolů",
        "zobrazuje jeden sprint"
      ]
    ]
  },
  {
    "task": "The task represented by a single QQTB row _ assigned to exactly one responsible team member and should not take more than _.",
    "answerList": ["is always", "one week"]
  },
  {
    "task": "What should every team member briefly adress during daily stand-up?",
    "answerList": [
      "What did he/she does since last stand-up.",
      "What will he/she does until next stand-up."
    ]
  },
  {
    "task": "What do we need to have to start the design phase?",
    "answerList": [
      "scope from the contract",
      "A4, PBS",
      "team of business analysts/designers",
      "UC List / UCS classification KKTR",
      "know-how of the business domain"
    ]
  },
  {
    "task": "To set up the design phase, we need to define what will be its outputs.",
    "answer": true
  },
  {
    "task": "Besides the Project manager, which project roles are expected to be involved during the design phase?",
    "answerList": [
      "Software Architect or at least Senior Developer",
      "Business Architect / Analyst",
      "Designer",
      "Test Architect"
    ]
  },
  {
    "task": "The outputs of design have to be developable in given estimates.",
    "answer": true
  },
  {
    "task": "What are the common tasks of the Project manager during the design phase?",
    "answerList": [
      "communication with the client",
      "organization of business meetings between team and product owners",
      "internal and external status reporting of the progress",
      "control the scope in terms of contract (with BA and SWA)"
    ]
  },
  {
    "task": "What are the most common problems of the design phase?",
    "answerList": [
      "The team has a lack of business domain knowledge.",
      "The design of the functionality is more complicated than expected.",
      "There can be errors or inconsistencies in the specification of the business process. It results in the redesign and reopening of some already closed specifications.",
      "Some third-party inputs are missing or will be delivered later than planned.",
      "The revision process stacks and spins around with never-ending comments."
    ]
  },
  {
    "task": "What are the most common problems of the development phase?",
    "answerList": [
      "Not sufficient technical knowledge, like new or unknown areas for the project team",
      "Development environment is not ready on time",
      "The business solution is too complicated, and it is hard to find a development solution within budget",
      "Not sufficient code quality"
    ]
  },
  {
    "task": "What do we need to have to start the development phase?",
    "answerList": [
      "closed and approved design",
      "KKTR",
      "team of developers",
      "knowledge of used technology",
      "prepared environment and development tools"
    ]
  },
  {
    "task": "The Project manager should set up the code revision process, prepare developers guidelines, define configuration management and other important topics for the development phase of each IT project.",
    "answer": false
  },
  {
    "task": "Connect the project roles with their scope of work during the development phase.",
    "answerList": [
      ["Project manager", "managing the project"],
      [
        "Business Architect / Analyst",
        "consulting to developers, solving inconsistency problems and bugs in the specification, possibly working on the scope of the next phases"
      ],
      ["Developer", "working on development tasks"],
      ["Tester", "preparing the test scenarios according to specifications"]
    ]
  },
  {
    "task": "In general, the Project manager _ know the Git Flow and access Git. However, the knowledge of the Git Flow and Git active monitoring _ him or her to manage the project better.",
    "answerList": ["does not have to", "helps"]
  },
  {
    "task": "What are the common tasks of the Project manager during the development phase?",
    "answerList": [
      "communication with the client",
      "organization of meetings to solve technological issues",
      "internal and external status reporting of the progress",
      "controlling the hours consumed by developers",
      "management and working with risks"
    ]
  },
  {
    "task": "Usually, our applications are using data from/to other applications and online interfaces to other systems. On top of that, different parts of the applications are frequently developed in different teams. This results in increased complexity of the development. In this relation, any issue usually means some reworks and can have a serious impact on time and budget.",
    "answer": true
  },
  {
    "task": "Connect the project roles with their scope of work during the testing phase.",
    "answerList": [
      ["Project manager", "Management of the project."],
      [
        "Test Architect",
        "Preparation of the test strategy/test approach (internal and external), ensuring that the test team (which is his responsibility) has everything they need (environments, data, notebooks, etc.)."
      ],
      [
        "SWA and developers",
        "Primary bug fixing and consultation in bug analysis, help with application system logs, etc."
      ],
      ["Tester", "Test execution, bug reporting, test scenarios creation."],
      [
        "BA and designers",
        "For the consultation of bugs and correct state, fix the bugs in the specification."
      ]
    ]
  },
  {
    "task": "We always need to test our applications because there is no such thing as bugless software.",
    "answer": true
  },
  {
    "task": "What do we need to have to start the testing phase?",
    "answerList": [
      "Test strategy.",
      "Agreed acceptance criteria (entry and exit).",
      "Closed business specification.",
      "Application or at least some part of it.",
      "List of use cases and test estimates."
    ]
  },
  {
    "task": "Sort the testing phases by how they follow each other.",
    "answerList": [
      "Development testing phase",
      "FAT phase",
      "UAT phase",
      "SIT phase",
      "Pre-Production testing phase"
    ]
  },
  {
    "task": "Which are the common testing types?",
    "answerList": [
      "Development testing.",
      "Factory Acceptance Testing (FAT).",
      "User Acceptance Testing (UAT).",
      "Performance testing."
    ]
  },
  {
    "task": "What can we take into account when creating testing estimates?",
    "answerList": [
      "The amount of time we have for testing.",
      "The capacity of the testing team.",
      "Testing types and activities that we need to cover.",
      "The amount of hours for design and implementation.",
      "Previous experiences with similar projects and tests."
    ]
  },
  {
    "task": "Connect the project roles with their scope of work during the testing phase.",
    "answerList": [
      ["Project manager", "Management of the project."],
      [
        "Test Architect",
        "Preparation of the test strategy/test approach (internal and external), ensuring that the test team (which is his responsibility) has everything they need (environments, data, notebooks, etc.)."
      ],
      [
        "SWA and developers",
        "Primary bug fixing and consultation in bug analysis, help with application system logs, etc."
      ],
      ["Tester", "Test execution, bug reporting, test scenarios creation."],
      [
        "BA and designers",
        "For the consultation of bugs and correct state, fix the bugs in the specification."
      ]
    ]
  },
  {
    "task": "What are the main tasks and responsibilities of a Project manager during the testing phase?",
    "answerList": [
      "With Test architect responsible for Test strategy to cover all the scope for testing.",
      "Responsibility for the budget (hours) and integrity of the estimates.",
      "Assessment and escalation of requirements from the customer which are unrealistic.",
      "Managing and working with risks - maintaining the Risk list.",
      "Communication with client / business owner to discuss complicated issues, organize 'Bug meetings' to clean up 'unsolvable' errors, and prioritize the others."
    ]
  },
  {
    "task": "The pitfall of testing is that it is dependent on all other project disciplines. It results in causality that if any of the other project disciplines are not doing well, testing will always suffer from it.",
    "answer": true
  },
  {
    "task": "The budget is usually prepared in three phases. Assign the detail of the estimate to the phase and relevant examples of the estimation.",
    "answerList": [
      [
        "Hourly estimate per module",
        "First phase",
        "Module 1 = 1 000 person-hours, Module 2 = 1 500 person-hours"
      ],
      [
        "Hourly estimate per Use Case",
        "Second phase",
        "Use Case 1 = 400 person-hours, Use Case 2 = 300 person-hours"
      ],
      [
        "Hourly estimate per UAF element",
        "Third phase",
        "Command 1 = 40 person-hours, Route 1 = 16 person-hours"
      ]
    ]
  },
  {
    "task": "For the realization budget is responsible _, and for its creation is responsible _.",
    "answerList": ["Production Manager", "Project Manager"]
  },
  {
    "task": "A budget for the stabilization phase should be determined at the beginning of the project at the latest.",
    "answer": true
  },
  {
    "task": "Realization budget involves the following parts:",
    "answerList": [
      "development effort",
      "other project costs (for IDE licenses, workplaces, environments, etc.)",
      "product licenses",
      "takeover to maintenance"
    ]
  },
  {
    "task": "In the preparation of realization budget can participate more organization units.",
    "answer": true
  },
  {
    "task": "Thanks to UAF, we can (re)use already existing products. In this connection, select what we should consider when creating a project budget.",
    "answerList": [
      "products license fees",
      "products integration effort",
      "products extension effort"
    ]
  },
  {
    "task": "A production contract is an agreement between _ and _ units. The production contract _ concluded between these units.",
    "answerList": ["Sales", "Production", "must always be"]
  },
  {
    "task": "For the preparation of PBC (Project Business Case), the necessary inputs are PBS and QQ.",
    "answer": true
  },
  {
    "task": "The project budget consists of:",
    "answerList": [
      "Financial summary",
      "Budget and Productivity",
      "Costs, Revenues",
      "Target Bonuses",
      "Assessment, Closing Up"
    ]
  },
  {
    "task": "The project budget should include Revenues that are about the planning of all costs on a project for the defined time.",
    "answer": false
  },
  {
    "task": "Která z následujících tvrzení o řízení rizik jsou pravdivá?",
    "answerList": [
      "The risk list is prepared during the start-up of the project and is updated during the whole project.",
      "An alternative scenario should be prepared for at least all risks from the Risk list.",
      "Throughout the project, we gradually reduce or even completely eliminate risks."
    ]
  },
  {
    "task": "V rámci řízení očekávání klienta je nutné pravidelně informovat všechny zainteresované role o aktuálním stavu, očekávaném cílovém stavu a možných posunech.",
    "answer": true
  },
  {
    "task": "Project risks have to be always influenceable.",
    "answer": false
  },
  {
    "task": "Which of the following information may contain Risk list?",
    "answerList": [
      "name",
      "description",
      "likelihood",
      "risk level",
      "risk treatment"
    ]
  },
  {
    "task": "Sort the parts of the Risk Life-Cycle in the proper order.",
    "answerList": [
      "Identification",
      "Analysis",
      "Mitigation",
      "Assessment",
      "Risk Response Activation"
    ]
  },
  {
    "task": "Which of the following options are good examples of the areas of customer expectations?",
    "answerList": [
      "Scope and quality of the delivery",
      "Budget",
      "Delivery terms",
      "Management processes and reporting",
      "Final solution proposal"
    ]
  },
  {
    "task": "Who is responsible for the management of the customer's expectations?",
    "answerList": ["Project Manager"]
  },
  {
    "task": "Customer cooperation should be specified in the proposal or final agreement. That is mainly because without needed cooperation from the customer, project terms and budget are impacted.",
    "answer": true
  },
  {
    "task": "Which of the following options are good to involve the customer in the IS development?",
    "answerList": [
      "Organization of regular status assessments.",
      "Open and transparent reporting.",
      "Continuous presentation of the outputs.",
      "The Project Manager tries to make sure that the client understands the project factually and the processes."
    ]
  },
  {
    "task": "Jak by mělo vypadat strukturované řešení problémů?",
    "answerList": [
      "identifikace a pojmenování",
      "analýza",
      "popis možných variant řešení",
      "eskalace",
      "zvolit správný typ řešení"
    ]
  },
  {
    "task": "Artefakt _ je vytvořen tak, aby řídil proces řešení problému od jeho identifikace až po výběr řešení, které problém vyřeší.  Artefakt analyzuje problém, popisuje varianty vedoucí k jeho řešení a definuje vybranou možnost.  Skutečné řešení je poté spravováno Klíčovým úkolem (KT) nebo jiným nástrojem pro řízení.",
    "answerList": ["Problem Resolution"]
  },
  {
    "task": "Každý problém je třeba posoudit z hlediska jeho závažnosti a _.",
    "answerList": ["složitosti"]
  },
  {
    "task": "Co vše se týká procesu řešení problémů?",
    "answerList": [
      "Cílem je řešit vzniklé problémy.",
      "Řešení a jejich hodnocení řídíme pomocí Klíčového úkolu (Key Task) nebo jiného nástroje pro řízení."
    ]
  },
  {
    "task": "Pokud potřebujeme problém rychle vyřešit, použijeme rychlá (alternativní) řešení, tzv. „workaround“, které problém dočasně zmírní.",
    "answer": true
  },
  {
    "task": "Která z následujících tvrzení o krizi na projektu jsou pravdivá?",
    "answerList": [
      "Správné řízení projektů a pravidelné reportování mohou snížit dopady a krátké trvání krize.",
      "Krize je stav projektu, ve kterém se projekt odchyluje (nebo se s vysokou pravděpodobností odchýlí)  od plánovaných parametrů a cílů projektu (obvykle od KKTR nebo očekávání klienta).",
      "Krizi může způsobit špatně řízená očekávání klienta."
    ]
  },
  {
    "task": "Co je cílem krizového řízení?",
    "answerList": [
      "Překlenout období, kdy došlo k odchylce mezi definovanými parametry a skutečným stavem, a vrátit rovnováhu.",
      "Zmírnit dopad krize a minimalizovat dobu trvání krize."
    ]
  },
  {
    "task": "Které z následujících tvrzení o reportování během krize není pravdivé?",
    "answerList": [
      "Četnost reportování v době krize je jednou za týden nebo dva."
    ]
  },
  {
    "task": "Která z následujících tvrzení/pouček pro řešení problémů jsou pravdivá?",
    "answerList": [
      "Standardizujte přístup a řešení opakujících se nestandardních problémů.",
      "Neztrácejte hlavu.",
      "Problémy, které jsou závažné a obtížně řešitelné, jsou velmi nebezpečné."
    ]
  },
  {
    "task": "What are the common causes of a crisis on the project?",
    "answerList": [
      "Unreal QSTB.",
      "Wrongly managed client's expectations.",
      "Not properly staffed team.",
      "Bad decisions."
    ]
  },
  {
    "task": "What three basic attributes do we need to ensure that information is secure (we also call it a Security Triad)?",
    "answerList": ["Confidentiality", "Integrity", "Availability"]
  },
  {
    "task": "Why is a Security Card for a project or product important?",
    "answerList": [
      "Provides demonstrable familiarity with the safety requirements of all collaborators working on a project or product.",
      "It is a single place where all relevant safety information requirements, information or measures are stored.",
      "You can use the Security Card to better manage information security projects and activities."
    ]
  },
  {
    "task": "What does the SSDLC (Secure Software Development Life Cycle) methodology bring?",
    "answerList": [
      "Better and safer products and software.",
      "Identification of security risks and issues from the beginning of development.",
      "Save costs on error correction.",
      "Improving awareness of information security and secure development."
    ]
  },
  {
    "task": "Individual SSDLC requirements are tied to _.",
    "answerList": ["the classification and riskiness of the project"]
  },
  {
    "task": "Who is responsible for filling in the Security Card?",
    "answerList": ["Project Manager", "Team Leader", "Product Manager"]
  },
  {
    "task": "When to report an information security incident?",
    "answerList": ["Whenever it is suspected or occurred."]
  },
  {
    "task": "Sort the parts of the change life cycle in proper order.",
    "answerList": [
      "Recorded",
      "Evaluated",
      "Authorized and prioritized",
      "Planned",
      "Documented, reviewed, implemented, and tested"
    ]
  },
  {
    "task": "Into which of the following areas can a project change have an impact?",
    "answerList": [
      "Scope of the delivery",
      "Non-functional requirements",
      "Timeline",
      "Deployment",
      "People"
    ]
  },
  {
    "task": "What are the common origins of changes on the projects?",
    "answerList": [
      "Evolution of the requirements in time.",
      "Unfulfilled expectations.",
      "Different understanding of requirements.",
      "Changes in workforce."
    ]
  },
  {
    "task": "All changes must be agreed upon by all relevant parties and captured in the change catalog that is regularly reported. The form of the change catalog is agreed upon at the beginning of the project (artifact, ticket tracking system, etc.).",
    "answer": true
  },
  {
    "task": "Who usually participates in project change estimation?",
    "answerList": [
      "Project Manager",
      "Software Architect",
      "Business Architect",
      "Test Architect"
    ]
  },
  {
    "task": "Co je výstupem akceptačního řízení?",
    "answerList": ["podepsaný akceptační protokol"]
  },
  {
    "task": "Akceptace je rozdělena do dvou procesů - <UU5.Bricks.Strong>Sestavení akceptačních kritérií</UU5.Bricks.Strong> na začátku projektu a <UU5.Bricks.Strong>Akceptační řízení</UU5.Bricks.Strong>, které by mělo být použito k vyhodnocení, zda poskytnutý výstup splňuje schválená akceptační kritéria.",
    "answer": true
  },
  {
    "task": "Které tvrzení o sestavování akceptačních kritérií jsou pravdivá?",
    "answerList": [
      "Akceptační kritéria jsou stanovena na začátku každého projektu.",
      "Musí být jednoznačně specifikovány.",
      "Akceptační kritéria závisí na práci/službě, kterou dodáváte, a na vaší smlouvě s klientem.",
      "Akceptační kritéria jsou jiná pro informační systém a jiná pro technický projekt."
    ]
  },
  {
    "task": "Součástí akceptačního řízení jsou vždy Uživatelské akceptační testy (UAT).",
    "answer": true
  },
  {
    "task": "_ snižuje riziko nepřijetí celé dodávky.  Používá se pro výstupy projektu vytvořené v jeho průběhu, jako jsou moduly informačního systému, dokumenty nebo dokonce některé kapitoly dokumentů.",
    "answerList": ["Průběžná akceptace"]
  },
  {
    "task": "Akceptační kritéria reflektují kategorie požadavků podle metodiky FURPS +. Přiřaďte, co každá kategorie znamená.",
    "answerList": [
      [
        "Functionality",
        "určujeme, zda jsou poskytovány funkčnosti specifikované v Technickém projektu"
      ],
      [
        "Usability",
        "we determine whether the user interface (GUI) matches to the graphic manual, quality of online help, training materials and documentation"
      ],
      [
        "Reliability",
        "zaměřuje se na výsledky testů (testování integrity, testování struktury, zátěžové testování)"
      ],
      [
        "Performance",
        "zaměřuje se na výsledky testů - Performance profile, Contention testy, Load testy and Benchmark testy"
      ],
      [
        "Supportability",
        "zaměřuje se na výsledky konfiguračních a instalačních testů"
      ]
    ]
  },
  {
    "task": "What types of acceptance do we have on projects?",
    "answerList": [
      "Continuous acceptance",
      "Acceptance with reservations",
      "Final acceptance"
    ]
  },
  {
    "task": "Kdo je zodpovědný za Uživatelské akceptační testy (UAT)?",
    "answerList": ["zákazník"]
  },
  {
    "task": "Jaké jsou vstupy do UAT?",
    "answerList": [
      "testovací scénáře a data",
      "informační systém",
      "podpora realizačního týmu dodavatele",
      "testovací tým zákazníka"
    ]
  },
  {
    "task": "Před zahájením Uživatelských akceptačních testů je třeba provést řadu přípravných kroků. To zahrnuje zejména přípravu testovacího prostředí, uživatelské scénáře, testovací data, nástroje, školení atd. Tyto přípravné kroky probíhají _.",
    "answerList": ["na straně zákazníka"]
  },
  {
    "task": "K převzetí projektu z vývoje do servisu může dojít i před akceptací vývojového projektu.",
    "answer": false
  },
  {
    "task": "Převzetí know-how projektu z vývoje do servisu lze provést třemi způsoby. Co proběhne ještě před převzetím projektu?",
    "answerList": [
      "zapojení pracovníků servisu do vývojového týmu",
      "zaučení vývojem"
    ]
  },
  {
    "task": "What are the integral questions in connection with the planning of UAT?",
    "answerList": [
      "WHAT is the goal, and what will be tested?",
      "HOW exactly will the system be tested?",
      "WHO will be responsible, who will participate, who will be a support role?",
      "WHEN UAT starts?"
    ]
  },
  {
    "task": "Which of the following parts should be included in Takeover Protocol?",
    "answerList": [
      "Formal particulars.",
      "The assistance of know-how takeover.",
      "Impacts on existing service.",
      "Deployment to live environment, stabilization.",
      "Reservations list and Reservations resolution plan."
    ]
  },
  {
    "task": "In which ways can a project be closed?",
    "answerList": ["Planned closure or Premature closure"]
  },
  {
    "task": "The only prerequisite of Project Final Assessment is that deliverables are <UU5.Bricks.Strong>delivered</UU5.Bricks.Strong> and <UU5.Bricks.Strong>accepted</UU5.Bricks.Strong>.",
    "answer": false
  },
  {
    "task": "Which steps include the Project Evaluation & Closure?",
    "answerList": [
      "Business Case evaluation",
      "Return of licenses",
      "Termination of test environments/servers (in case they are not passed to the maintenance)",
      "Creation of people assessment",
      "Compilation of Lessons learned"
    ]
  }
]
